kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
                if ( registers.op_status == NAVX_OP_STATUS_IMU_AUTOCAL_IN_PROGRESS ) {

                    if ( mpu_did_dmp_gyro_biases_change(&((struct flash_cal_data *)flashdata)->dmpcaldata) ) {
                        imu_cal_bias_change_count++;
                    }

                    if ( ( ( registers.sensor_status & NAVX_SENSOR_STATUS_MOVING ) == 0 ) &&
                            ( ( registers.sensor_status & NAVX_SENSOR_STATUS_YAW_STABLE ) ) &&
                            ( imu_cal_bias_change_count > 2 ) ) {

                        /* Sensor is still, and DMP calibration constants have been accumulated */
                        /* Store to flash memory and begin accumulating yaw offsets.            */

                        registers.cal_status &= ~NAVX_CAL_STATUS_IMU_CAL_STATE_MASK;
                        registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_ACCUMULATE;
                        cal_led_cycle = flash_off;
                        ((struct flash_cal_data *)flashdata)->dmpcaldatavalid = true;
                        FlashStorage.commit();
                        registers.op_status = NAVX_OP_STATUS_NORMAL;
                        start_timestamp = HAL_GetTick();
                        /* Reset integration of velocity/displacement on all axes */
                        reset_velocity_and_dispacement_integrator(&mpudata,0x3F);
                    }
                }

                if ( registers.op_status == NAVX_OP_STATUS_NORMAL ) {

                    /* Accumulate yaw offset if not yet completely acquired. */

                    if ( !yaw_offset_calibration_complete ) {
                        if ( ( ( registers.sensor_status & NAVX_SENSOR_STATUS_MOVING ) == 0 ) &&
                                ( registers.sensor_status & NAVX_SENSOR_STATUS_YAW_STABLE ) ) {

                            yaw_accumulator += mpudata.yaw;
                            yaw_offset_accumulator_count++;

                            if ( yaw_offset_accumulator_count >= current_yaw_history_size ) {

                                registers.cal_status &= ~NAVX_CAL_STATUS_IMU_CAL_STATE_MASK;
                                registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_COMPLETE;

                                calibrated_yaw_offset = yaw_accumulator / yaw_offset_accumulator_count;
                                registers.yaw_offset = IMURegisters::encodeSignedHundredthsFloat(calibrated_yaw_offset);
                                set_yaw_offset(calibrated_yaw_offset);
                                yaw_offset_calibration_complete = true;
                                send_stream_response[0] = true;
                                send_stream_response[1] = true;
                                last_temp_compensation_check_timestamp = HAL_GetTick();
                                /* Reset integration of velocity/displacement on all axes */
                                reset_velocity_and_dispacement_integrator(&mpudata,0x3F);
                            }
                        } else {

                            if ( ( last_scan - start_timestamp ) > yaw_offset_startup_timeout_ms ) {

                                /* Timed out waiting for inital yaw offset accumulation.  This case */
                                /* can occur if the sensor is not still during the startup timeout  */
                                /* period.  In this case, set yaw/quat offsets to 0.                */

                                registers.cal_status &= ~NAVX_CAL_STATUS_IMU_CAL_STATE_MASK;
                                registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_COMPLETE;
                                calibrated_yaw_offset = 0.0f;
                                registers.yaw_offset = IMURegisters::encodeSignedHundredthsFloat(calibrated_yaw_offset);
                                set_yaw_offset(calibrated_yaw_offset);
                                yaw_offset_calibration_complete = true;
                                send_stream_response[0] = true;
                                send_stream_response[1] = true;
                                last_temp_compensation_check_timestamp = HAL_GetTick();
                                /* Reset integration of velocity/displacement on all axes */
                                reset_velocity_and_dispacement_integrator(&mpudata,0x3F);

                            } else {
                                yaw_offset_accumulator_count = 0;
                                yaw_accumulator = 0.0;
                            }
                        }
                    }

                    /* Periodically check for new dmp gyro biases if the temperature has changed. */

                    if ( ( last_scan - last_temp_compensation_check_timestamp ) > 1000 ) {
                        last_temp_compensation_check_timestamp = last_scan;
                        if ( ( ( registers.sensor_status & NAVX_SENSOR_STATUS_MOVING ) == 0 ) &&
                                ( registers.sensor_status & NAVX_SENSOR_STATUS_YAW_STABLE ) ) {
                            if ( mpu_did_dmp_gyro_biases_change(&curr_dmpcaldata) ) {
                                if ( fabs( curr_dmpcaldata.mpu_temp_c -
                                        ((struct flash_cal_data *)flashdata)->dmpcaldata.mpu_temp_c) >= 2.0 ) {
                                    calc_linear_temp_correction_coefficients( 	&(((struct flash_cal_data *)flashdata)->dmpcaldata),
                                            &curr_dmpcaldata,
                                            &temp_correction_coefficients);
                                    temp_correction_coefficients_valid = true;
                                }
                            }
                        }

                        /* Periodically re-calculate dmp gyro biases based upon current temperature */
                        if ( temp_correction_coefficients_valid ) {
                            interpolate_temp_correction_offsets( 	&temp_correction_coefficients,
                                    mpudata.temp_c,
                                    &test_dmpcaldata );
                            /* If temperature compensation slope is active */
                            /* read temp and apply new biases if temperature shift is detected */
                            if ( fabs( last_gyro_bias_load_temperature - mpudata.temp_c ) > .25 ) {
                                //mpu_apply_dmp_biases(&test_dmpcaldata); NOT WORKING VERY WELL YET
                                //last_gyro_bias_load_temperature = mpudata.temp_c;
                            }
                        }
                    }
                }
            } else {
                /* Error retrieving dmp data - possible I2C error. */
                bool mpu_present = mpu_detect();
                HAL_LED2_On( mpu_present ? 1 : 0);
                if ( !mpu_present ) {
                    timestamp = HAL_GetTick();
                    uint32_t max_wait_ms = 3 * (1000 / registers.update_rate_hz);
                    if ( ( last_scan > 0 ) && ( timestamp - last_scan > max_wait_ms ) ) {
                        bool bus_error = (__HAL_I2C_GET_FLAG(&hi2c2, I2C_FLAG_BERR) == SET);
                        bool bus_busy = (__HAL_I2C_GET_FLAG(&hi2c2, I2C_FLAG_BUSY) == SET);
                        if( bus_error || bus_busy ) {
                            /* Bus Busy, or Bus Error.  Reset the I2C Interface, in an attempt */
                            /* to resolve this condition.                                      */
                            HAL_I2C_Reset(&hi2c2);
                            i2c_bus_reset_count++;
                            //HAL_I2C_Reset(&hi2c2);
                            last_scan = HAL_GetTick();
                        }
                    }
                }
            }
        } else {
            /* No Data Ready Interrupt received */
            timestamp = HAL_GetTick();
            uint32_t max_wait_ms = 6 * (1000 / registers.update_rate_hz);
            if ( ( last_scan > 0 ) && ( timestamp - last_scan > max_wait_ms ) ) {
                HAL_LED1_On(0);
                HAL_LED2_On(0);
                uint32_t temp;
                bool group_enabled = false;
                bool pin_masked_in = false;
                bool rising_edge_trigger = false;
                bool falling_edge_trigger = false;
                bool pull_up_direction = false;
                temp = SYSCFG->EXTICR[2];
                if ( temp & 0x00000003 ) {
                    /* EXTI8 is enabled for GPIOC Group */
                    group_enabled = true;
                }
                temp = EXTI->IMR;
                if ( temp & 0x00000100 ) {
                    /* GPIO 8 is masked in */
                    pin_masked_in = true;
                }
                temp = EXTI->RTSR;
                if ( temp & 0x00000100 ) {
                    /* GPIO 8 is rising edge triggered */
                    rising_edge_trigger = true;
                }
                temp = EXTI->FTSR;
                if ( temp & 0x00000100 ) {
                    /* GPIO 8 is falling edge triggered */
                    falling_edge_trigger = true;
                }
                temp = GPIOC->PUPDR;
                if ( temp & 0x0001000 ) {
                    /* GPIO 8 is pull-up direction */
                    pull_up_direction = true;
                }

                /* HACK:  For some reason, in certain error cases (e.g., when  */
                /* power to I2C/SPI/UART is removed and then re-applied), the  */
                /* PC8 Interrupt Mask is disabled.  For the navX-MXP, this     */
                /* condition causes further MPU interrupts to be missed.       */
                /* Therefore, whenever this condition is detected, re-         */
                /* configure GPIO pin : PC8 (MPU) for rising-edge interrupts   */
                GPIO_InitTypeDef GPIO_InitStruct;

