kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
                GPIO_InitStruct.Pin = GPIO_PIN_8;
                GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
                GPIO_InitStruct.Pull = GPIO_NOPULL;
                HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
                last_scan = timestamp;
                i2c_interrupt_reset_count++;
#ifdef DEBUG_I2C_COMM
                for ( int ifx = 0; ifx < num_serial_interfaces; ifx++ ) {
                    serial_interfaces[ifx]->println("Scanning");
                }
#endif
            }
        }

        /* Process inbound configuration requests */
        for ( int ifx = 0; ifx < num_serial_interfaces; ifx++ ) {
            /* Scan for start of message, discarding any bytes that precede it. */
            bool found_start_of_message = false;
            while ( serial_interfaces[ifx]->available() > 0 ) {
                char rcv_byte = serial_interfaces[ifx]->peek();
                if ( rcv_byte != PACKET_START_CHAR ) {
                    serial_interfaces[ifx]->read();
                }
                else {
                    if ( last_packet_start_rx_timestamp[ifx] == 0 ) {
                        last_packet_start_rx_timestamp[ifx] = HAL_GetTick();
                    }
                    found_start_of_message = true;
                    break;
                }
            }

            /* If packet start recently found, but insufficient bytes have been */
            /* received after waiting the maximum packet rx time, flush the     */
            /* packet start Indicator.                                          */
            if ( found_start_of_message &&
                    serial_interfaces[ifx]->available() < MIN_UART_MESSAGE_LENGTH &&
                    HAL_GetTick() - last_packet_start_rx_timestamp[ifx] > (uint32_t)UART_RX_PACKET_TIMEOUT_MS ) {
                /* Flush the start of message indicator. */
                serial_interfaces[ifx]->read();
                last_packet_start_rx_timestamp[ifx] = 0;
                break;
            }

            /* If sufficient bytes have been received, process the data and */
            /* if a valid message is received, handle it.                   */

            if( found_start_of_message && ( serial_interfaces[ifx]->available() >= MIN_UART_MESSAGE_LENGTH ) ) {
                size_t bytes_read = 0;
                last_packet_start_rx_timestamp[ifx] = 0;
                while ( serial_interfaces[ifx]->available() ) {
                    if ( bytes_read >= sizeof(inbound_data) ) {
                        break;
                    }
                    inbound_data[bytes_read++] = serial_interfaces[ifx]->read();
                }

                /* If this is a binary message, the packet length is encoded. */
                /* In this case, wait for additional bytes to arrive, with a  */
                /* timeout in case of error.                                  */

                if ( inbound_data[1] == BINARY_PACKET_INDICATOR_CHAR ) {
                    char expected_len = inbound_data[2] + 2;
                    if ( bytes_read < expected_len ) {
                        uint32_t start_wait_timestamp = HAL_GetTick();
                        while ( bytes_read < expected_len ) {
                            if ( serial_interfaces[ifx]->available() ) {
                                inbound_data[bytes_read++] = serial_interfaces[ifx]->read();
                            } else {
                                if ( HAL_GetTick() - start_wait_timestamp > (uint32_t)UART_RX_PACKET_TIMEOUT_MS ) {
                                    break;
                                }
                            }
                        }
                    }
                }

                size_t i = 0;
                /* Scan the buffer looking for valid packets */
                while ( i < bytes_read )
                {
                    int bytes_remaining = bytes_read - i;
                    unsigned char update_rate_hz;
                    int packet_length = 0;
                    struct mag_calibration_data newcal;
                    AHRS_DATA_ACTION action;
                    float tuning_value;
                    char new_stream_type;
                    if ( (packet_length = IMUProtocol::decodeStreamCommand(
                            &inbound_data[i], bytes_remaining,
                            new_stream_type, update_rate_hz ) )  )
                    {
                        update_rate_hz = clip_sample_rate(update_rate_hz);
                        if ( update_rate_hz != mpuconfig.mpu_update_rate ) {
                            /* If update rate changed, send stream responses on all interfaces. */
                            sample_rate_update = true;
                            new_sample_rate = update_rate_hz;
                            mpuconfig.mpu_update_rate = new_sample_rate;
                            send_stream_response[0] = true;
                            send_stream_response[1] = true;
                        } else {
                            /* No update rate change.  Send stream response only on this interface. */
                            send_stream_response[ifx] = true;
                        }
                        if ( ( new_stream_type == MSGID_YPR_UPDATE) ||
                                ( new_stream_type == MSGID_QUATERNION_UPDATE ) ||
                                ( new_stream_type == MSGID_GYRO_UPDATE ) ||
                                ( new_stream_type == MSGID_AHRS_UPDATE ) ||
                                ( new_stream_type == MSGID_AHRSPOS_UPDATE ) ) {
                            update_type[ifx] = new_stream_type;
                        }
                    }
                    else if ( ( packet_length = AHRSProtocol::decodeMagCalCommand(
                            &inbound_data[i], bytes_remaining,
                            data_action,
                            &(newcal.bias[0]), &(newcal.xform[0][0]),
                            newcal.earth_mag_field_norm ) ) ) {
                        if ( data_action == DATA_SET ) {
                            if ( newcal.earth_mag_field_norm == 0.0f ) {
                                /* Disallow 0 value, to avoid divide by zero. */
                                newcal.earth_mag_field_norm = 0.001f;
                            }
                            float previous_mag_disturbance_ratio = ((struct flash_cal_data *)flashdata)->magcaldata.mag_disturbance_ratio;
                            memcpy(&((struct flash_cal_data *)flashdata)->magcaldata,&newcal,sizeof(newcal));
                            ((struct flash_cal_data *)flashdata)->magcaldata.mag_disturbance_ratio = previous_mag_disturbance_ratio;
                            mpu_apply_mag_cal_data(&(((struct flash_cal_data *)flashdata)->magcaldata));
                            registers.cal_status |= NAVX_CAL_STATUS_MAG_CAL_COMPLETE;
                            FlashStorage.commit();
                        }
                        send_mag_cal_response[ifx] = true;
                    }
                    else if ( ( packet_length = AHRSProtocol::decodeTuningVariableCmd(
                            &inbound_data[i], bytes_remaining,
                            action, tuning_var_id, tuning_value ) ) ) {
                        tuning_var_status = set_tuning_var( action, tuning_var_id, tuning_value, true );
                        send_tuning_var_set_response[ifx] = true;
                    }
                    else if ( ( packet_length = AHRSProtocol::decodeDataGetRequest(
                            &inbound_data[i], bytes_remaining,
                            retrieved_data_type, retrieved_var_id ) ) ) {
                        send_data_retrieval_response[ifx] = true;
                    }
                    else if ( ( packet_length = AHRSProtocol::decodeIntegrationControlCmd(
                            &inbound_data[i], bytes_remaining,
                            integration_control_action, integration_control_parameter ) ) ) {
                        send_integration_control_response[ifx] = true;
                        integration_control_update = true;
                        new_integration_control = integration_control_action;
                    }
                    if ( packet_length > 0 ) {
                        i += packet_length;
                    } else {
                        i++;
                    }
                }
            }

