kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
void i2c_hard_reset()
{
    HAL_I2C_DeInit(&hi2c3);
    /* Perform software reset */
    hi2c3.Instance->CR1 |= 0x8000;
    /* Clear all registers */
    hi2c3.Instance->CR1 = 0;
    hi2c3.Instance->CR2 = 0;
    hi2c3.Instance->CCR = 0;
    hi2c3.Instance->TRISE = 0;
    hi2c3.Instance->SR1 = 0;
    hi2c3.Instance->SR2 = 0;
    hi2c3.Instance->OAR1 = 0;
    hi2c3.Instance->OAR2 = 0;
    /* Release software reset */
    hi2c3.Instance->CR1 &= ~0x8000;
    HAL_I2C_Init(&hi2c3);
}

/* Prepare for next reception on the I2C3 (external control) port */
/* This function includes a retry mechanism, and also will reset  */
/* the port in case of a timeout.                                 */

HAL_StatusTypeDef prepare_next_i2c_receive()
{
    HAL_StatusTypeDef status = HAL_I2C_Slave_Receive_IT(&hi2c3, (uint8_t*)i2c3_RxBuffer, 2);
    if ( status == HAL_BUSY ) {
        unsigned long prepare_i2c_receive_last_attempt_timestamp = HAL_GetTick();
        while ( status == HAL_BUSY )
        {
            status = HAL_I2C_Slave_Receive_IT(&hi2c3, (uint8_t*)i2c3_RxBuffer, 2);
            if ( (HAL_GetTick() - prepare_i2c_receive_last_attempt_timestamp) > I2C_PREPARE_RECEIVE_TIMEOUT_MS) {
                HAL_I2C_DeInit(&hi2c3);
                HAL_I2C_Init(&hi2c3);
                status = HAL_I2C_Slave_Receive_IT(&hi2c3, (uint8_t*)i2c3_RxBuffer, 2);
                if ( status != HAL_OK ) {
                    i2c_hard_reset();
                    status = HAL_I2C_Slave_Receive_IT(&hi2c3, (uint8_t*)i2c3_RxBuffer, 2);
                    if ( status != HAL_OK ) {
                        prepare_i2c_receive_timeout_count++;
                    }
                }
                break;
            }
        }
    }
    if ( status == HAL_OK ) {
        i2c_rx_in_progress = true;
        last_i2c_rx_start_timestamp = HAL_GetTick();
    }
    return status;
}

void process_writable_register_update( uint8_t requested_address, uint8_t *reg_addr, uint8_t value )
{
    if ( requested_address == NAVX_REG_UPDATE_RATE_HZ ) {
        *reg_addr = clip_sample_rate(value);
        new_sample_rate = *reg_addr;
        sample_rate_update = true;
    } else if ( requested_address == NAVX_REG_INTEGRATION_CTL) {
        /* This is a write-only register */
        new_integration_control = value;
        integration_control_update = true;
    }
}

int unexpected_receive_size_count = 0;

void HAL_I2C_SlaveRxCpltCallback(I2C_HandleTypeDef *I2cHandle)
{
    HAL_StatusTypeDef status;
    uint8_t *reg_addr;
    uint16_t max_size;
    uint16_t num_bytes_received = I2cHandle->XferSize - I2cHandle->XferCount;
    uint8_t *rx_bytes_start = I2cHandle->pBuffPtr - num_bytes_received;
    bool i2c_transmitting = false;
    bool write = false;
    i2c_rx_in_progress = false;
    if ( I2cHandle->Instance == I2C3 ) {
        if ( I2cHandle->Instance->SR2 & I2C_SR2_TRA ) {
        } else {
            /* Master Receive bit set:  1 byte is received, the address of the register to begin reading from */
            if ( num_bytes_received == 2 ) {
                uint8_t requested_address = rx_bytes_start[0];
                uint8_t num_bytes = rx_bytes_start[1];
                if ( requested_address & 0x80 ) {
                    write = true;
                    requested_address &= ~0x80;
                }
                reg_addr = GetRegisterAddressAndMaximumSize(requested_address, max_size);
                if ( reg_addr ) {
                    if ( write ) {
                        process_writable_register_update( requested_address, reg_addr, num_bytes /* value */ );
                    } else {
                        uint8_t i2c_bytes_to_be_transmitted = (num_bytes > max_size) ? max_size : num_bytes;
                        memcpy(i2c_tx_buffer,reg_addr,i2c_bytes_to_be_transmitted);
                        status = HAL_BUSY;
                        unsigned long prepare_i2c_tx_last_attempt_timestamp = 0;
                        while ( status == HAL_BUSY ) /* Consider a timeout on this wait... */
                        {
                            status = HAL_I2C_Slave_Transmit_DMA(&hi2c3, i2c_tx_buffer, i2c_bytes_to_be_transmitted);
                            if ( status == HAL_OK ) {
                                i2c_transmitting = true;
                                i2c_tx_in_progress = true;
                                last_i2c_tx_start_timestamp = HAL_GetTick();
                                break;
                            } else {
                                /* I2C Transmit not ready to request start.     */
                                /* If timeout waiting occurs, the I2C interface */
                                /* likely needs to be reset.                    */
                                if ( prepare_i2c_tx_last_attempt_timestamp == 0 ) {
                                    prepare_i2c_tx_last_attempt_timestamp = HAL_GetTick();
                                } else if ( HAL_GetTick() - prepare_i2c_tx_last_attempt_timestamp >
                                            I2C_PREPARE_TRANSMIT_TIMEOUT_MS) {
                                    /* Transmit aborted, client will need to */
                                    /* timeout.                              */
                                    i2c_hard_reset();
                                    break;
                                }
                            }
                        }
                    }
                }
            }
            else {
                unexpected_receive_size_count++;
            }
        }
        if ( !i2c_transmitting ) {
            i2c_tx_in_progress = false;
            prepare_next_i2c_receive();
        }
    }
}

void HAL_I2C_SlaveTxCpltCallback(I2C_HandleTypeDef *I2cHandle)
{
    HAL_StatusTypeDef status;
    if ( I2cHandle->Instance == I2C3 )
    {
        i2c_tx_in_progress = false;
        status = prepare_next_i2c_receive();
    }
}

void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *I2cHandle)
{
    /* The "AF" (Ack fail) error will occur in the case of a burst read */
    /* if the receiver terminates the read before all bytes are         */
    /* transmitted.  In this case, simply clear the transmit buffer     */
    /* pointer; else, reset the I2C interface.                          */
    if ( I2cHandle->Instance == I2C3 )
    {
        last_i2c_err_code = I2cHandle->ErrorCode;
        if ( I2cHandle->ErrorCode == HAL_I2C_ERROR_AF ) {
            I2cHandle->XferCount = 0;
            I2cHandle->XferSize = 0;
            I2cHandle->pBuffPtr = 0;
        } else {
            HAL_I2C_DeInit(I2cHandle);
            HAL_I2C_Init(I2cHandle);
        }

        i2c_rx_in_progress = false;
        i2c_tx_in_progress = false;
        prepare_next_i2c_receive();
        i2c_error_count++;
    }
}

bool spi_transmitting = false;
uint8_t spi_bytes_to_be_transmitted = 0;
unsigned long last_spi_tx_start_timestamp = 0;
#define SPI_TX_TIMEOUT_MS ((unsigned long)10)

