kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
void Reset_SPI() {
    HAL_SPI_DeInit(&hspi1);
    HAL_SPI_Init(&hspi1);
    spi_transmitting = false;
    HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, 3);
}

int wrong_size_spi_receive_count = 0;
int invalid_char_spi_receive_count = 0;
int invalid_reg_address_spi_count = 0;
int spi_error_count = 0;
int spi_ovr_error_count = 0;
int spi_tx_complete_timeout_count = 0;

uint8_t spi_tx_buffer[NAVX_REG_LAST + 1];

void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
    uint8_t *reg_addr;
    uint16_t max_size;
    uint8_t reg_address;
    uint8_t reg_count;
    uint8_t received_crc;
    uint8_t calculated_crc;
    bool write = false;
    if ( hspi->Instance == SPI1 ) {
        if ( !spi_transmitting ) {
            int num_bytes_received = hspi->RxXferSize - hspi->RxXferCount;
            if ( num_bytes_received == 3 ) {
                reg_address = spi1_RxBuffer[0];
                reg_count = spi1_RxBuffer[1];
                received_crc = spi1_RxBuffer[2];
                calculated_crc = IMURegisters::getCRCWithTable(crc_lookup_table,spi1_RxBuffer,2);
                if ( ( reg_address != 0xFF ) && (reg_count > 0 ) && ( received_crc == calculated_crc ) ) {
                    if ( reg_address & 0x80 ) {
                        write = true;
                        reg_address &= ~0x80;
                    }
                    reg_addr = GetRegisterAddressAndMaximumSize(reg_address, max_size);
                    if ( reg_addr ) {
                        if ( write ) {
                            process_writable_register_update( reg_address, reg_addr, reg_count /* value */ );
                            HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer,3);
                        } else {
                            spi_transmitting = true;
                            spi_bytes_to_be_transmitted = (reg_count > max_size) ? max_size : reg_count;
                            memcpy(spi_tx_buffer,reg_addr,spi_bytes_to_be_transmitted);
                            spi_tx_buffer[spi_bytes_to_be_transmitted] =
                                    IMURegisters::getCRCWithTable(crc_lookup_table, spi_tx_buffer,
                                                                  (uint8_t)spi_bytes_to_be_transmitted);
                            HAL_SPI_Transmit_DMA(&hspi1, spi_tx_buffer, spi_bytes_to_be_transmitted+1);
                            last_spi_tx_start_timestamp = HAL_GetTick();
                        }
                    } else {
                        invalid_reg_address_spi_count++;
                        HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer,3);
                    }
                } else {
                    invalid_char_spi_receive_count++;
                    /* If repeated invalid requests are received, and if the */
                    /* SPI interface is still busy, reset the SPI interface. */
                    /* This condition occurs sometimes after the RoboRIO     */
                    /* host computer is power-cycled.                        */
                    if ( ( (invalid_char_spi_receive_count % 5) == 0 ) &&
                         ( __HAL_SPI_GET_FLAG(&hspi1,SPI_FLAG_BSY) != RESET ) ) {
                        Reset_SPI();
                   } else {
                        HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer,3);
                   }
                }
            } else {
                wrong_size_spi_receive_count++;
                HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer,3);
            }
        }
    }
}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
    if ( hspi->Instance == SPI1 ) {
        /* HAL_SPI_ERROR_OVR: Master has transmitted bytes, the slave hasn't read the */
        /* previous byte in the receive register.  This case occurs when the          */
        /* Receive ISR hasn't been responded to before the master starts writing.     */

        /* Clear the error, and prepare for next receive.                             */
        spi_error_count++;
        spi_transmitting = false;
        if ( hspi->ErrorCode == HAL_SPI_ERROR_OVR) {
            __HAL_SPI_CLEAR_OVRFLAG(hspi);
            spi_ovr_error_count++;
        }
        HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, 3);
    }
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
    if ( hspi->Instance == SPI1 ) {
        spi_transmitting = false;
        HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, 3);
    }
}

